/*
数据类型转换
*/ 
const typeConversion = {
	
	
	/*******************************Number****************************************************/
	Rp(n) {
		/**
		 * 数字转中文
		 * 
		*/
	  let cnum = ['零', '一', '二', '三', '四', '五', '六', '七', '八', '九'];
	  let s = '';
	  n = '' + n; // 数字转为字符串
	
	  for (var i = 0; i < n.length; i++) {
	    s += cnum[parseInt(n.charAt(i))];
	  }
	
	  return s;
	},
	
	/*******************************String****************************************************************/
	
}
export default typeConversion